test/request-response-samples/SetResource__should_correctly_set_element_if_complex-type_has_same_name/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.bigdatacollect.or" xmlns:n="http://www.bigdatacollect.or/Name/Types"><soap:Body><n:SetResourceRequest xmlns:n="http://www.bigdatacollect.or/Name/Types" xmlns="http://www.bigdatacollect.or/Name/Types"><n:Resource><n:Resource>test</n:Resource></n:Resource></n:SetResourceRequest></soap:Body></soap:Envelope>