test/request-response-samples/SetResource__should_correctly_set_element_if_complex-type_has_same_name/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><ns1:SetResourceRequest xmlns:ns1="http://www.bigdatacollect.or/Name/Types"><ns1:Resource><ns1:Resource>test</ns1:Resource></ns1:Resource></ns1:SetResourceRequest></soap:Body></soap:Envelope>